DataProcessors/ЗаменитьЗнчТЧ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗаменитьЗнчТЧ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>УчетныеСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцииСотрудника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УчетныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВхода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыОбращения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>45</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>450</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Структура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗаменитьЗнчТЧ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура заполнитьУСНаСервере()
	Объект.УчетныеСистемы.Очистить();
	Для каждого э Из Обк.УчетныеСистемы Цикл
		новСтрУС = Объект.УчетныеСистемы.Добавить();
			новСтрУС.Наименование = э.Наименование;
			новСтрУС.ФункцииСотрудника = э.ФункцииСотрудника;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура заполнитьУС(Команда)
	заполнитьУСНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУДНаСервере()
	Объект.УчетныеДанные.Очистить();
	Для каждого э Из Обк.УчетныеДанные Цикл
		новСтрУД = Объект.УчетныеДанные.Добавить();
			новСтрУД.Наименование = э.Наименование;
			новСтрУД.ИмяВхода = э.ИмяВхода;
			новСтрУД.Пароль = э.Пароль;
			новСтрУД.Подключение = э.Подключение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУД(Команда)
	ЗаполнитьУДНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаСервере
Процедура ЗаменитьНаСервере()
	заменяемыйОбк = Обк.ПолучитьОбъект();
	Если Объект.УчетныеСистемы.Количество() Тогда
		заменяемыйОбк.Файлы.Очистить();
		Для каждого э Из Объект.УчетныеСистемы Цикл
			новСтрУС = заменяемыйОбк.Файлы.Добавить();
				новСтрУС.Наименование = э.Наименование;
				новСтрУС.Файл = э.ФункцииСотрудника;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.УчетныеДанные.Количество() Тогда
		заменяемыйОбк.УчетныеДанные.Очистить();
		Для каждого э Из Объект.УчетныеДанные Цикл
			новСтрУД = заменяемыйОбк.УчетныеДанные.Добавить();
				новСтрУД.Наименование = э.Наименование;
				новСтрУД.ИмяВхода = э.ИмяВхода;
				новСтрУД.Пароль = э.Пароль;
				новСтрУД.Подключение = э.Подключение;
		КонецЦикла;
	КонецЕсли;
	заменяемыйОбк.Записать();
	
	Сообщить("Новые данные записаны!");
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	ЗаменитьНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	заменяемыйОбк = Обк.ПолучитьОбъект();
	заменяемыйОбк.Завершен = ИСТИНА;
	заменяемыйОбк.РуководительИТ = ЛОЖЬ;
	заменяемыйОбк.ОтказКуратором = ЛОЖЬ;
	заменяемыйОбк.РуководительИТКомментарий = РуководительИТКомментарий;
	заменяемыйОбк.Записать();
	
	Сообщить("Обращение завершено!");
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОКэшировании()
	Сообщить("Для получения внесенных изменений необходимо перезайти в программу так как старые данные кэшированы!");
КонецПроцедуры

&НаСервере
Процедура ЗаменитьРеквизитыНаСервере()
	
	Если Объект.РеквизитыОбращения.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Обк) Тогда
		Сообщить("Нет данных для изменения");
		Возврат;
	КонецЕсли;
	
	текОбк = Обк.ПолучитьОбъект();
	Для Каждого э Из Объект.РеквизитыОбращения Цикл		
		Попытка
			текОбк[э.имя] = э.Значение;
		Исключение
			Сообщить("Ошибка получения реквизита объекта " + э.имя);
		КонецПопытки;
	КонецЦикла;
	текОбк.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьРеквизиты(Команда)
	ЗаменитьРеквизитыНаСервере();
	Сообщить("Объект изменен успешно!");
КонецПроцедуры

&НаСервере
Процедура НаполнитьТЧСтруктура(свойство)
	Для Каждого э Из Обк.Метаданные()[свойство] Цикл
		новаяСтрока = Объект.Структура.Добавить();
		новаяСтрока.Наименование = э.Имя;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуру(Команда)
	Если НЕ ЗначениеЗаполнено(Обк) Тогда
		Сообщить("Укажите изменяемый объект!");
		Возврат;
	КонецЕсли;
	
	Объект.Структура.Очистить();
	НаполнитьТЧСтруктура("Реквизиты");
	НаполнитьТЧСтруктура("СтандартныеРеквизиты");
КонецПроцедуры

&НаСервере
Процедура ОчиститьУДНаСервере()
	заменяемыйОбк = Обк.ПолучитьОбъект();
	Объект.УчетныеДанные.Очистить() ;
	заменяемыйОбк.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУД(Команда)
	ОчиститьУДНаСервере(); 
	Сообщить("Таблица учетные данные очищена и обк записан!");
	Сообщить("Убедитесь что очистили УД - Обращения и Задачи!");
	СообщитьОКэшировании();
КонецПроцедуры
